LoadTesting/WebSignUp_Ping_1000-Production.txt
Run #1:

Running 2m test @ https://members.thriveglobal.com
  12 threads and 12 connections
  Thread calibration: mean lat.: 3423.042ms, rate sampling interval: 11796ms
  Thread calibration: mean lat.: 3265.145ms, rate sampling interval: 11354ms
  Thread calibration: mean lat.: 3368.138ms, rate sampling interval: 11714ms
  Thread calibration: mean lat.: 3340.761ms, rate sampling interval: 11812ms
  Thread calibration: mean lat.: 3308.500ms, rate sampling interval: 11337ms
  Thread calibration: mean lat.: 3444.193ms, rate sampling interval: 11812ms
  Thread calibration: mean lat.: 3582.325ms, rate sampling interval: 12165ms
  Thread calibration: mean lat.: 3293.941ms, rate sampling interval: 11272ms
  Thread calibration: mean lat.: 3315.620ms, rate sampling interval: 11460ms
  Thread calibration: mean lat.: 3438.935ms, rate sampling interval: 11722ms
  Thread calibration: mean lat.: 3376.817ms, rate sampling interval: 11698ms
  Thread calibration: mean lat.: 3370.752ms, rate sampling interval: 11370ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    40.43s    20.00s    1.31m    59.87%
    Req/Sec    28.90      3.03    34.00     87.04%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   39.88s
 75.000%    0.95m
 90.000%    1.12m
 99.000%    1.29m
 99.900%    1.30m
 99.990%    1.31m
 99.999%    1.31m
100.000%    1.31m

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

    6217.727     0.000000            1         1.00
   12681.215     0.100000         3862         1.11
   19398.655     0.200000         7725         1.25
   27066.367     0.300000        11595         1.43
   33488.895     0.400000        15451         1.67
   39878.655     0.500000        19312         2.00
   43384.831     0.550000        21258         2.22
   47546.367     0.600000        23173         2.50
   50659.327     0.650000        25104         2.86
   53739.519     0.700000        27039         3.33
   57016.319     0.750000        28980         4.00
   58589.183     0.775000        29932         4.44
   60260.351     0.800000        30905         5.00
   61964.287     0.825000        31878         5.71
   63602.687     0.850000        32840         6.67
   65372.159     0.875000        33803         8.00
   66191.359     0.887500        34284         8.89
   67076.095     0.900000        34760        10.00
   69533.695     0.912500        35255        11.43
   71827.455     0.925000        35723        13.33
   72876.031     0.937500        36232        16.00
   73269.247     0.943750        36470        17.78
   73662.463     0.950000        36709        20.00
   74055.679     0.956250        36941        22.86
   74514.431     0.962500        37183        26.67
   74973.183     0.968750        37414        32.00
   75300.863     0.971875        37551        35.56
   75563.007     0.975000        37662        40.00
   76021.759     0.978125        37785        45.71
   76480.511     0.981250        37911        53.33
   76742.655     0.984375        38016        64.00
   76873.727     0.985938        38083        71.11
   77004.799     0.987500        38145        80.00
   77135.871     0.989062        38198        91.43
   77266.943     0.990625        38263       106.67
   77398.015     0.992188        38328       128.00
   77463.551     0.992969        38361       142.22
   77529.087     0.993750        38385       160.00
   77594.623     0.994531        38406       182.86
   77725.695     0.995313        38444       213.33
   77856.767     0.996094        38487       256.00
   77856.767     0.996484        38487       284.44
   77922.303     0.996875        38513       320.00
   77922.303     0.997266        38513       365.71
   77987.839     0.997656        38532       426.67
   78053.375     0.998047        38554       512.00
   78053.375     0.998242        38554       568.89
   78118.911     0.998437        38572       640.00
   78118.911     0.998633        38572       731.43
   78118.911     0.998828        38572       853.33
   78184.447     0.999023        38585      1024.00
   78184.447     0.999121        38585      1137.78
   78249.983     0.999219        38595      1280.00
   78249.983     0.999316        38595      1462.86
   78249.983     0.999414        38595      1706.67
   78315.519     0.999512        38599      2048.00
   78381.055     0.999561        38602      2275.56
   78381.055     0.999609        38602      2560.00
   78512.127     0.999658        38606      2925.71
   78512.127     0.999707        38606      3413.33
   78577.663     0.999756        38609      4096.00
   78577.663     0.999780        38609      4551.11
   78643.199     0.999805        38613      5120.00
   78643.199     0.999829        38613      5851.43
   78643.199     0.999854        38613      6826.67
   78643.199     0.999878        38613      8192.00
   78643.199     0.999890        38613      9102.22
   78708.735     0.999902        38615     10240.00
   78708.735     0.999915        38615     11702.86
   78708.735     0.999927        38615     13653.33
   78708.735     0.999939        38615     16384.00
   78708.735     0.999945        38615     18204.44
   78774.271     0.999951        38617     20480.00
   78774.271     1.000000        38617          inf
#[Mean    =    40430.573, StdDeviation   =    20003.025]
#[Max     =    78708.736, Total count    =        38617]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  42256 requests in 2.00m, 69.47MB read
  Non-2xx or 3xx responses: 42256
Requests/sec:    352.01
Transfer/sec:    592.65KB

Run #2:

Running 2m test @ https://members.thriveglobal.com
  12 threads and 12 connections
  Thread calibration: mean lat.: 3323.172ms, rate sampling interval: 11321ms
  Thread calibration: mean lat.: 3118.806ms, rate sampling interval: 10903ms
  Thread calibration: mean lat.: 3091.081ms, rate sampling interval: 10518ms
  Thread calibration: mean lat.: 3254.786ms, rate sampling interval: 11616ms
  Thread calibration: mean lat.: 3132.555ms, rate sampling interval: 10829ms
  Thread calibration: mean lat.: 3152.531ms, rate sampling interval: 11321ms
  Thread calibration: mean lat.: 3458.054ms, rate sampling interval: 11567ms
  Thread calibration: mean lat.: 3247.232ms, rate sampling interval: 10985ms
  Thread calibration: mean lat.: 3159.542ms, rate sampling interval: 11116ms
  Thread calibration: mean lat.: 3357.787ms, rate sampling interval: 11780ms
  Thread calibration: mean lat.: 3252.650ms, rate sampling interval: 11304ms
  Thread calibration: mean lat.: 3212.984ms, rate sampling interval: 11370ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    42.13s    20.61s    1.30m    57.84%
    Req/Sec    29.09      1.74    33.00     84.82%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   43.19s
 75.000%    1.00m
 90.000%    1.17m
 99.000%    1.27m
 99.900%    1.29m
 99.990%    1.30m
 99.999%    1.30m
100.000%    1.30m

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

    5963.775     0.000000            1         1.00
   13320.191     0.100000         3925         1.11
   20725.759     0.200000         7859         1.25
   27377.663     0.300000        11774         1.43
   35225.599     0.400000        15707         1.67
   43188.223     0.500000        19639         2.00
   46563.327     0.550000        21588         2.22
   49872.895     0.600000        23551         2.50
   53379.071     0.650000        25517         2.86
   56623.103     0.700000        27471         3.33
   59965.439     0.750000        29437         4.00
   61669.375     0.775000        30417         4.44
   63406.079     0.800000        31416         5.00
   65175.551     0.825000        32391         5.71
   67010.559     0.850000        33374         6.67
   68681.727     0.875000        34366         8.00
   69468.159     0.887500        34854         8.89
   70385.663     0.900000        35336        10.00
   71237.631     0.912500        35827        11.43
   72089.599     0.925000        36321        13.33
   72941.567     0.937500        36811        16.00
   73334.783     0.943750        37065        17.78
   73727.999     0.950000        37294        20.00
   74186.751     0.956250        37570        22.86
   74514.431     0.962500        37773        26.67
   74973.183     0.968750        38054        32.00
   75169.791     0.971875        38182        35.56
   75366.399     0.975000        38292        40.00
   75563.007     0.978125        38400        45.71
   75759.615     0.981250        38510        53.33
   76021.759     0.984375        38651        64.00
   76152.831     0.985938        38717        71.11
   76283.903     0.987500        38779        80.00
   76414.975     0.989062        38841        91.43
   76546.047     0.990625        38899       106.67
   76677.119     0.992188        38962       128.00
   76742.655     0.992969        38991       142.22
   76808.191     0.993750        39020       160.00
   76873.727     0.994531        39047       182.86
   76939.263     0.995313        39071       213.33
   77004.799     0.996094        39093       256.00
   77070.335     0.996484        39116       284.44
   77135.871     0.996875        39142       320.00
   77135.871     0.997266        39142       365.71
   77201.407     0.997656        39168       426.67
   77201.407     0.998047        39168       512.00
   77266.943     0.998242        39187       568.89
   77266.943     0.998437        39187       640.00
   77332.479     0.998633        39204       731.43
   77332.479     0.998828        39204       853.33
   77398.015     0.999023        39215      1024.00
   77398.015     0.999121        39215      1137.78
   77398.015     0.999219        39215      1280.00
   77463.551     0.999316        39221      1462.86
   77529.087     0.999414        39224      1706.67
   77594.623     0.999512        39228      2048.00
   77594.623     0.999561        39228      2275.56
   77660.159     0.999609        39231      2560.00
   77660.159     0.999658        39231      2925.71
   77725.695     0.999707        39236      3413.33
   77725.695     0.999756        39236      4096.00
   77725.695     0.999780        39236      4551.11
   77791.231     0.999805        39239      5120.00
   77791.231     0.999829        39239      5851.43
   77791.231     0.999854        39239      6826.67
   77856.767     0.999878        39243      8192.00
   77856.767     0.999890        39243      9102.22
   77856.767     0.999902        39243     10240.00
   77856.767     0.999915        39243     11702.86
   77856.767     0.999927        39243     13653.33
   77856.767     0.999939        39243     16384.00
   77856.767     0.999945        39243     18204.44
   77856.767     0.999951        39243     20480.00
   77856.767     0.999957        39243     23405.71
   77856.767     0.999963        39243     27306.67
   77856.767     0.999969        39243     32768.00
   77856.767     0.999973        39243     36408.89
   77922.303     0.999976        39244     40960.00
   77922.303     1.000000        39244          inf
#[Mean    =    42127.390, StdDeviation   =    20608.636]
#[Max     =    77856.768, Total count    =        39244]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  43086 requests in 2.00m, 70.84MB read
  Non-2xx or 3xx responses: 43086
Requests/sec:    358.78
Transfer/sec:    604.04KB

Run #3:

Running 2m test @ https://members.thriveglobal.com
  12 threads and 12 connections
  Thread calibration: mean lat.: 2855.683ms, rate sampling interval: 13033ms
  Thread calibration: mean lat.: 2957.792ms, rate sampling interval: 13115ms
  Thread calibration: mean lat.: 2873.413ms, rate sampling interval: 12926ms
  Thread calibration: mean lat.: 2780.331ms, rate sampling interval: 12910ms
  Thread calibration: mean lat.: 2933.094ms, rate sampling interval: 13000ms
  Thread calibration: mean lat.: 2924.603ms, rate sampling interval: 13099ms
  Thread calibration: mean lat.: 3006.246ms, rate sampling interval: 13287ms
  Thread calibration: mean lat.: 2818.827ms, rate sampling interval: 12935ms
  Thread calibration: mean lat.: 2983.760ms, rate sampling interval: 13049ms
  Thread calibration: mean lat.: 2942.949ms, rate sampling interval: 12943ms
  Thread calibration: mean lat.: 2806.223ms, rate sampling interval: 12951ms
  Thread calibration: mean lat.: 2720.405ms, rate sampling interval: 12615ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    46.81s    20.89s    1.40m    58.60%
    Req/Sec    25.62      3.93    32.00     68.75%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   44.60s
 75.000%    1.10m
 90.000%    1.27m
 99.000%    1.38m
 99.900%    1.39m
 99.990%    1.40m
 99.999%    1.40m
100.000%    1.40m

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

    7204.863     0.000000            1         1.00
   18186.239     0.100000         3438         1.11
   26263.551     0.200000         6879         1.25
   33505.279     0.300000        10320         1.43
   39124.991     0.400000        13761         1.67
   44597.247     0.500000        17188         2.00
   47513.599     0.550000        18916         2.22
   51904.511     0.600000        20633         2.50
   59080.703     0.650000        22351         2.86
   61898.751     0.700000        24063         3.33
   65896.447     0.750000        25778         4.00
   67436.543     0.775000        26656         4.44
   69074.943     0.800000        27515         5.00
   70909.951     0.825000        28356         5.71
   73138.175     0.850000        29220         6.67
   74579.967     0.875000        30100         8.00
   75300.863     0.887500        30527         8.89
   75956.223     0.900000        30927        10.00
   76677.119     0.912500        31388        11.43
   77332.479     0.925000        31811        13.33
   77987.839     0.937500        32233        16.00
   78381.055     0.943750        32453        17.78
   78774.271     0.950000        32675        20.00
   79167.487     0.956250        32882        22.86
   79626.239     0.962500        33093        26.67
   80347.135     0.968750        33291        32.00
   81068.031     0.971875        33399        35.56
   81461.247     0.975000        33520        40.00
   81723.391     0.978125        33626        45.71
   81985.535     0.981250        33746        53.33
   82182.143     0.984375        33851        64.00
   82313.215     0.985938        33907        71.11
   82378.751     0.987500        33940        80.00
   82509.823     0.989062        34019        91.43
   82575.359     0.990625        34054       106.67
   82706.431     0.992188        34111       128.00
   82771.967     0.992969        34141       142.22
   82837.503     0.993750        34170       160.00
   82903.039     0.994531        34195       182.86
   82968.575     0.995313        34215       213.33
   83034.111     0.996094        34232       256.00
   83099.647     0.996484        34244       284.44
   83165.183     0.996875        34256       320.00
   83230.719     0.997266        34270       365.71
   83361.791     0.997656        34293       426.67
   83427.327     0.998047        34308       512.00
   83427.327     0.998242        34308       568.89
   83492.863     0.998437        34320       640.00
   83492.863     0.998633        34320       731.43
   83558.399     0.998828        34330       853.33
   83558.399     0.999023        34330      1024.00
   83623.935     0.999121        34337      1137.78
   83623.935     0.999219        34337      1280.00
   83689.471     0.999316        34344      1462.86
   83689.471     0.999414        34344      1706.67
   83755.007     0.999512        34347      2048.00
   83820.543     0.999561        34350      2275.56
   83820.543     0.999609        34350      2560.00
   83886.079     0.999658        34353      2925.71
   83886.079     0.999707        34353      3413.33
   83951.615     0.999756        34356      4096.00
   83951.615     0.999780        34356      4551.11
   84017.151     0.999805        34359      5120.00
   84017.151     0.999829        34359      5851.43
   84017.151     0.999854        34359      6826.67
   84017.151     0.999878        34359      8192.00
   84082.687     0.999890        34363      9102.22
   84082.687     1.000000        34363          inf
#[Mean    =    46806.406, StdDeviation   =    20894.253]
#[Max     =    84017.152, Total count    =        34363]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  36999 requests in 2.00m, 60.83MB read
  Non-2xx or 3xx responses: 36999
Requests/sec:    308.24
Transfer/sec:    518.96KB

Run #4

Running 2m test @ https://members.thriveglobal.com
  12 threads and 23 connections
  Thread calibration: mean lat.: 3216.878ms, rate sampling interval: 11280ms
  Thread calibration: mean lat.: 3255.476ms, rate sampling interval: 11403ms
  Thread calibration: mean lat.: 3241.757ms, rate sampling interval: 11362ms
  Thread calibration: mean lat.: 3372.794ms, rate sampling interval: 11583ms
  Thread calibration: mean lat.: 3160.495ms, rate sampling interval: 10813ms
  Thread calibration: mean lat.: 3279.882ms, rate sampling interval: 11624ms
  Thread calibration: mean lat.: 3283.117ms, rate sampling interval: 11354ms
  Thread calibration: mean lat.: 3274.063ms, rate sampling interval: 11419ms
  Thread calibration: mean lat.: 3199.413ms, rate sampling interval: 11247ms
  Thread calibration: mean lat.: 3314.451ms, rate sampling interval: 11272ms
  Thread calibration: mean lat.: 3315.900ms, rate sampling interval: 11624ms
  Thread calibration: mean lat.: 3256.304ms, rate sampling interval: 11444ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    40.59s    19.89s    1.26m    57.74%
    Req/Sec    30.81      1.04    33.00     94.50%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   40.44s
 75.000%    0.96m
 90.000%    1.14m
 99.000%    1.24m
 99.900%    1.26m
 99.990%    1.26m
 99.999%    1.26m
100.000%    1.26m

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

    6148.095     0.000000            1         1.00
   13008.895     0.100000         4145         1.11
   20135.935     0.200000         8289         1.25
   26804.223     0.300000        12434         1.43
   33587.199     0.400000        16579         1.67
   40435.711     0.500000        20725         2.00
   43876.351     0.550000        22796         2.22
   47218.687     0.600000        24869         2.50
   50888.703     0.650000        26935         2.86
   54525.951     0.700000        28999         3.33
   57868.287     0.750000        31072         4.00
   59703.295     0.775000        32109         4.44
   61538.303     0.800000        33160         5.00
   63242.239     0.825000        34185         5.71
   64946.175     0.850000        35225         6.67
   66617.343     0.875000        36265         8.00
   67436.543     0.887500        36793         8.89
   68222.975     0.900000        37285        10.00
   69074.943     0.912500        37821        11.43
   69926.911     0.925000        38344        13.33
   70778.879     0.937500        38875        16.00
   71172.095     0.943750        39129        17.78
   71565.311     0.950000        39374        20.00
   72024.063     0.956250        39633        22.86
   72417.279     0.962500        39883        26.67
   72810.495     0.968750        40148        32.00
   73007.103     0.971875        40274        35.56
   73269.247     0.975000        40432        40.00
   73465.855     0.978125        40556        45.71
   73662.463     0.981250        40680        53.33
   73859.071     0.984375        40796        64.00
   73990.143     0.985938        40862        71.11
   74121.215     0.987500        40938        80.00
   74186.751     0.989062        40978        91.43
   74317.823     0.990625        41049       106.67
   74448.895     0.992188        41121       128.00
   74514.431     0.992969        41154       142.22
   74579.967     0.993750        41180       160.00
   74645.503     0.994531        41207       182.86
   74776.575     0.995313        41248       213.33
   74842.111     0.996094        41265       256.00
   74907.647     0.996484        41282       284.44
   74973.183     0.996875        41299       320.00
   75038.719     0.997266        41317       365.71
   75104.255     0.997656        41335       426.67
   75169.791     0.998047        41347       512.00
   75235.327     0.998242        41359       568.89
   75300.863     0.998437        41369       640.00
   75366.399     0.998633        41374       731.43
   75431.935     0.998828        41380       853.33
   75497.471     0.999023        41388      1024.00
   75563.007     0.999121        41395      1137.78
   75563.007     0.999219        41395      1280.00
   75628.543     0.999316        41404      1462.86
   75628.543     0.999414        41404      1706.67
   75694.079     0.999512        41412      2048.00
   75694.079     0.999561        41412      2275.56
   75694.079     0.999609        41412      2560.00
   75694.079     0.999658        41412      2925.71
   75759.615     0.999707        41418      3413.33
   75759.615     0.999756        41418      4096.00
   75759.615     0.999780        41418      4551.11
   75759.615     0.999805        41418      5120.00
   75825.151     0.999829        41423      5851.43
   75825.151     0.999854        41423      6826.67
   75825.151     0.999878        41423      8192.00
   75825.151     0.999890        41423      9102.22
   75825.151     0.999902        41423     10240.00
   75825.151     0.999915        41423     11702.86
   75825.151     0.999927        41423     13653.33
   75890.687     0.999939        41426     16384.00
   75890.687     1.000000        41426          inf
#[Mean    =    40589.364, StdDeviation   =    19894.229]
#[Max     =    75825.152, Total count    =        41426]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  45130 requests in 2.00m, 74.20MB read
  Non-2xx or 3xx responses: 45130
Requests/sec:    375.88
Transfer/sec:    632.83KB

Run #5:

Running 2m test @ https://members.thriveglobal.com
  12 threads and 23 connections
  Thread calibration: mean lat.: 3282.942ms, rate sampling interval: 10936ms
  Thread calibration: mean lat.: 3191.429ms, rate sampling interval: 11173ms
  Thread calibration: mean lat.: 3251.582ms, rate sampling interval: 11149ms
  Thread calibration: mean lat.: 3319.333ms, rate sampling interval: 11329ms
  Thread calibration: mean lat.: 3184.866ms, rate sampling interval: 11042ms
  Thread calibration: mean lat.: 3354.407ms, rate sampling interval: 11411ms
  Thread calibration: mean lat.: 3360.820ms, rate sampling interval: 11632ms
  Thread calibration: mean lat.: 3299.798ms, rate sampling interval: 11370ms
  Thread calibration: mean lat.: 3267.553ms, rate sampling interval: 11182ms
  Thread calibration: mean lat.: 3315.483ms, rate sampling interval: 11517ms
  Thread calibration: mean lat.: 3175.073ms, rate sampling interval: 10887ms
  Thread calibration: mean lat.: 3336.249ms, rate sampling interval: 11329ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    40.40s    19.42s    1.27m    57.97%
    Req/Sec    31.76      1.66    36.00     90.91%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   40.76s
 75.000%    0.95m
 90.000%    1.11m
 99.000%    1.22m
 99.900%    1.26m
 99.990%    1.27m
 99.999%    1.28m
100.000%    1.28m

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

    6078.463     0.000000            1         1.00
   13074.431     0.100000         4269         1.11
   20348.927     0.200000         8537         1.25
   27099.135     0.300000        12802         1.43
   33914.879     0.400000        17069         1.67
   40763.391     0.500000        21336         2.00
   44138.495     0.550000        23459         2.22
   47382.527     0.600000        25590         2.50
   50724.863     0.650000        27736         2.86
   54001.663     0.700000        29860         3.33
   57278.463     0.750000        31988         4.00
   58949.631     0.775000        33069         4.44
   60588.031     0.800000        34131         5.00
   62128.127     0.825000        35202         5.71
   63635.455     0.850000        36260         6.67
   65208.319     0.875000        37317         8.00
   66027.519     0.887500        37863         8.89
   66879.487     0.900000        38405        10.00
   67698.687     0.912500        38926        11.43
   68550.655     0.925000        39453        13.33
   69402.623     0.937500        40010        16.00
   69795.839     0.943750        40262        17.78
   70189.055     0.950000        40526        20.00
   70647.807     0.956250        40813        22.86
   71041.023     0.962500        41065        26.67
   71499.775     0.968750        41355        32.00
   71696.383     0.971875        41474        35.56
   71892.991     0.975000        41598        40.00
   72155.135     0.978125        41718        45.71
   72482.815     0.981250        41877        53.33
   72744.959     0.984375        42001        64.00
   72876.031     0.985938        42058        71.11
   73072.639     0.987500        42136        80.00
   73203.711     0.989062        42181        91.43
   73400.319     0.990625        42257       106.67
   73596.927     0.992188        42333       128.00
   73662.463     0.992969        42355       142.22
   73727.999     0.993750        42382       160.00
   73859.071     0.994531        42426       182.86
   73990.143     0.995313        42456       213.33
   74252.287     0.996094        42483       256.00
   74383.359     0.996484        42498       284.44
   74579.967     0.996875        42519       320.00
   74711.039     0.997266        42532       365.71
   74973.183     0.997656        42550       426.67
   75104.255     0.998047        42565       512.00
   75169.791     0.998242        42572       568.89
   75300.863     0.998437        42588       640.00
   75300.863     0.998633        42588       731.43
   75628.543     0.998828        42599       853.33
   75759.615     0.999023        42606      1024.00
   75825.151     0.999121        42609      1137.78
   75890.687     0.999219        42613      1280.00
   75956.223     0.999316        42617      1462.86
   76087.295     0.999414        42622      1706.67
   76152.831     0.999512        42626      2048.00
   76218.367     0.999561        42630      2275.56
   76218.367     0.999609        42630      2560.00
   76283.903     0.999658        42633      2925.71
   76349.439     0.999707        42636      3413.33
   76349.439     0.999756        42636      4096.00
   76414.975     0.999780        42640      4551.11
   76414.975     0.999805        42640      5120.00
   76414.975     0.999829        42640      5851.43
   76414.975     0.999854        42640      6826.67
   76480.511     0.999878        42644      8192.00
   76480.511     0.999890        42644      9102.22
   76480.511     0.999902        42644     10240.00
   76480.511     0.999915        42644     11702.86
   76480.511     0.999927        42644     13653.33
   76480.511     0.999939        42644     16384.00
   76480.511     0.999945        42644     18204.44
   76480.511     0.999951        42644     20480.00
   76546.047     0.999957        42646     23405.71
   76546.047     1.000000        42646          inf
#[Mean    =    40397.467, StdDeviation   =    19419.188]
#[Max     =    76480.512, Total count    =        42646]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  46390 requests in 2.00m, 76.27MB read
  Non-2xx or 3xx responses: 46390
Requests/sec:    386.54
Transfer/sec:    650.78KB

Run #6:

Running 2m test @ https://members.thriveglobal.com
  12 threads and 23 connections
  Thread calibration: mean lat.: 3367.415ms, rate sampling interval: 11853ms
  Thread calibration: mean lat.: 3223.196ms, rate sampling interval: 11083ms
  Thread calibration: mean lat.: 3265.829ms, rate sampling interval: 11124ms
  Thread calibration: mean lat.: 3286.503ms, rate sampling interval: 11567ms
  Thread calibration: mean lat.: 3416.150ms, rate sampling interval: 11599ms
  Thread calibration: mean lat.: 3234.904ms, rate sampling interval: 11419ms
  Thread calibration: mean lat.: 3220.658ms, rate sampling interval: 11116ms
  Thread calibration: mean lat.: 3274.461ms, rate sampling interval: 11362ms
  Thread calibration: mean lat.: 3340.753ms, rate sampling interval: 11419ms
  Thread calibration: mean lat.: 3390.007ms, rate sampling interval: 11878ms
  Thread calibration: mean lat.: 3256.240ms, rate sampling interval: 11124ms
  Thread calibration: mean lat.: 3654.198ms, rate sampling interval: 12214ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    41.43s    20.24s    1.30m    57.80%
    Req/Sec    29.81      1.29    33.00     92.59%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   41.62s
 75.000%    0.98m
 90.000%    1.15m
 99.000%    1.26m
 99.900%    1.29m
 99.990%    1.30m
 99.999%    1.30m
100.000%    1.30m

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

    6143.999     0.000000            1         1.00
   13115.391     0.100000         3992         1.11
   20250.623     0.200000         7982         1.25
   27475.967     0.300000        11975         1.43
   34668.543     0.400000        15973         1.67
   41615.359     0.500000        19973         2.00
   45154.303     0.550000        21967         2.22
   48463.871     0.600000        23950         2.50
   51937.279     0.650000        25957         2.86
   55574.527     0.700000        27952         3.33
   59047.935     0.750000        29937         4.00
   60719.103     0.775000        30936         4.44
   62390.271     0.800000        31949         5.00
   64094.207     0.825000        32944         5.71
   65765.375     0.850000        33923         6.67
   67371.007     0.875000        34924         8.00
   68222.975     0.887500        35446         8.89
   69009.407     0.900000        35934        10.00
   69795.839     0.912500        36420        11.43
   70844.415     0.925000        36920        13.33
   72220.671     0.937500        37419        16.00
   72744.959     0.943750        37687        17.78
   73203.711     0.950000        37943        20.00
   73596.927     0.956250        38184        22.86
   73990.143     0.962500        38419        26.67
   74383.359     0.968750        38667        32.00
   74579.967     0.971875        38789        35.56
   74776.575     0.975000        38921        40.00
   74973.183     0.978125        39046        45.71
   75169.791     0.981250        39179        53.33
   75431.935     0.984375        39317        64.00
   75497.471     0.985938        39349        71.11
   75628.543     0.987500        39420        80.00
   75759.615     0.989062        39483        91.43
   75890.687     0.990625        39542       106.67
   76087.295     0.992188        39610       128.00
   76152.831     0.992969        39633       142.22
   76283.903     0.993750        39684       160.00
   76349.439     0.994531        39707       182.86
   76414.975     0.995313        39726       213.33
   76546.047     0.996094        39762       256.00
   76611.583     0.996484        39780       284.44
   76677.119     0.996875        39793       320.00
   76742.655     0.997266        39804       365.71
   76873.727     0.997656        39823       426.67
   76939.263     0.998047        39833       512.00
   77004.799     0.998242        39843       568.89
   77070.335     0.998437        39855       640.00
   77070.335     0.998633        39855       731.43
   77201.407     0.998828        39867       853.33
   77266.943     0.999023        39873      1024.00
   77332.479     0.999121        39879      1137.78
   77332.479     0.999219        39879      1280.00
   77398.015     0.999316        39886      1462.86
   77398.015     0.999414        39886      1706.67
   77463.551     0.999512        39892      2048.00
   77463.551     0.999561        39892      2275.56
   77529.087     0.999609        39895      2560.00
   77594.623     0.999658        39898      2925.71
   77594.623     0.999707        39898      3413.33
   77660.159     0.999756        39903      4096.00
   77660.159     0.999780        39903      4551.11
   77660.159     0.999805        39903      5120.00
   77660.159     0.999829        39903      5851.43
   77725.695     0.999854        39904      6826.67
   77791.231     0.999878        39905      8192.00
   77791.231     0.999890        39905      9102.22
   77856.767     0.999902        39907     10240.00
   77856.767     0.999915        39907     11702.86
   77856.767     0.999927        39907     13653.33
   77856.767     0.999939        39907     16384.00
   77856.767     0.999945        39907     18204.44
   77922.303     0.999951        39909     20480.00
   77922.303     1.000000        39909          inf
#[Mean    =    41425.238, StdDeviation   =    20243.460]
#[Max     =    77856.768, Total count    =        39909]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  43598 requests in 2.00m, 71.68MB read
  Non-2xx or 3xx responses: 43598
Requests/sec:    363.27
Transfer/sec:    611.59KB